{
  "Intro": {
    "1": "I am currently studying Full Stack Development. I would like to delve more into the front-end, as I enjoy the creative side of creating an appealing and unique browser, as well as the challenges and rewards that come from communicating with customers. I enjoy creating React projects with a MERN Stack, teaching myself Shopify, with my customised Shopify site and working on my Unity game using C#."
  },
  "JobTitle": {
    "1": "Front-end Developer"
  },
  "AboutMe": {
    "1": "I have a Bachelor of Communications, majoring in Digital Media and minoring in Advertising. I first started working in Marketing and Customer Service, but have recently been travelling the world working in Australia at a resort and a cattle station. I also worked on a super yacht in the Mediterranean Sea and was the House Manager at a private estate in Guernsey. I am very good at adapting to new situation and environments and am familiar withn a change in scenery. I have decided to come back to my Digital Media background and add to my skills of Web Development. When I am not coding, I am delving into the French language and keeping the time on the drums."
  },
  "Projects": {
    "1": "Projects"
  },
  "Project": {
    "1": "Restaurant Reservation App",
    "2": "Bootstrap Website",
    "3": "React Online Shop",
    "4": "ChatBot",
    "5": "Unity Game Mesozoic 3023"
  },
  "NavBar": {
    "1": "Home",
    "2": "About Me"
  },
  "LanguagesAndSoftware": {
    "1": "MERN Stack",
    "2": "Auth0",
    "3": "Bootstrap",
    "4": "React",
    "5": "Filter & Sort",
    "6": "JavaScript",
    "7": "Jest",
    "8": "C#",
    "9": "Unity",
    "10": "CSS Grid",
    "11": "Cinema 4D"
  },
  "Links": {
    "1": "Live Demo"
  },
  "Spotify": {
    "1": "Here's a taste of the music I enjoy!"
  },
  "ProjectContent": {
    "1": "The Reservationizr was the 2nd project of my Server-Side paper at the Developers Institute. It allows a user to log in to their account via Auth0 and view the reservations that they have made with specific restaurants. It uses React for the front end with Auth0's protected routes to filter out what content a user can see based on whether they are logged in or not. It is using Express.js along with JWT's for the GET and POST API requests, along with Node.js as the server language. This server is talking to a MongoDB Atlas database which stores the JSON data collections. In the future, I would like to add PATCH and DELETE requests to give the user more control over thier reservations.",
    "2": "This Bootstrap website was my very first attempt at a portfolio website, before I had learnt React. It's core focus was to teach me Bootstrap, whilst using my previous knowledge of HTML, CSS and some JavaScript. I was influenced by the grid style layout that you often see on photography pages/portfolios. The image grids within each nav-link follow the photography page style, where all images are different sizes, however they still fit nicely within a rectangle container. In order to push this project live, I used React and Vite to create a build through the GitHub repository.",
    "3": "Jap Snack was my third project of the Client-Side paper at the Developers Institute. It is a website that allows a user to purchase Japanese Snacks. It is the first website that I have used React. We used Stripe to feature projects that a user could purchase. There is also the ability to filter products by specific category and sort the list of products by the highest and lowest prices.",
    "4": "The Adrenaline Bot was the second project of the Client-Side paper. It uses JavaScript conditional blocks of code to check user input based on the options that it has given to the user. It uses edge cases to make sure that it can provide the best direction and user experience possible. For example, if the user types 'skydive' when requested, it will still give them the option, as if they typed 'sky dive'. It also stores the user's name that they enter and refers to them during their interaction with the Chat Bot.",
    "5": "This project is my pride and joy! I took a C# course through Udemy and have decided to put that language to the test through Unity. I have followed the HexMap tutorial by CatLikeCoding to generate a single plane in Unity which morphs into a tile map. This tile map can be customized by the player, however long term I would like it to generate a map upon the awakening of that scene. At the moment a have a shape in place of a unit that a player can control and move using A* pathfinding to determine the shortest route to travel. Long term I would like to turn this into a game similar to Jurassic World Alive, but with an XCOM styled battle system."
  },
  "OtherProjects": {
    "1": "Other Projects"
  }
}
