{
  "Intro": {
    "1": "I am currently studying Full Stack Development. I would like to delve more into the front-end, as I enjoy the creative side of creating an appealing and unique browser, as well as the challenges and rewards that come from communicating with customers. I enjoy creating React projects with a MERN Stack, teaching myself Shopify, with my customised Shopify site and working on my Unity game using C#."
  },
  "JobTitle": {
    "1": "Front-end Developer"
  },
  "AboutMe": {
    "1": "I have a Bachelor of Communications, majoring in Digital Media and minoring in Advertising. I first started working in Marketing and Customer Service, but have recently been travelling the world working in Australia at a resort and a cattle station. I also worked on a super yacht in the Mediterranean Sea and was the House Manager at a private estate in Guernsey. I am very good at adapting to new situation and environments and am familiar with a change in scenery. I have decided to come back to my Digital Media background and add to my skills of Web Development. When I am not coding, I am delving into the French language and keeping the time on the drums."
  },
  "Projects": {
    "1": "Projects",
    "2": "I have completed a variety of projects, ranging from Salesforce migrations to mobile games, e-commerce and hobby sites using MERN stacks, chatbots, and drag-and-drop website builders, including Shopify, Wix, and WordPress.",
    "3": "My front-end projects delve into CSS frameworks such as Bootstrap and Tailwind, which were utilized in designing this site. Additionally, I employ testing frameworks like Jest in conjunction with conditional statements in JavaScript. I also explore drag-and-drop website builders such as Wix, combined with Elementor.",
    "4": "The back-end projects I have created explore the use of languages in the MERN stack, along with access authorization via Auth0 to ensure that each user sees content relevant to them. Additionally, I developed an online Japanese snacks shop that filters and sorts products based on their food category. The products are rendered using the Stripe API.",
    "5": "I am currently in the process of creating a game using the Unity engine. This mobile game features a turn-based hexagonal grid that enables users to strategically compete using dinosaurs that they can collect. It includes mini-games such as a jigsaw puzzle builder, hidden-item finder, and a pipe-flow game.",
    "6": "I completed a real-world project while studying for my Salesforce Administrator certification. During this project, I delved into web-to-lead, queues, auto-response rules, quotes, AppExchange content, surveys, flows, and user permission sets.",
    "7": "One of my greatest passions in my spare time is turning my favourite moments into videos. I have created many travel videos for myself to look back on and enjoy playing around with different video styles and filters, creating a specific feel for each video. I use 3D modeling software, After Effects, and various video editing software."
  },
  "FilterButtons": {
    "1": "All",
    "2": "Games",
    "3": "Videos"
  },
  "Project": {
    "1": "Restaurant Reservation App",
    "2": "Bootstrap Website",
    "3": "Online Shop",
    "4": "ChatBot",
    "5": "Unity Game Mesozoic 3023",
    "6": "Glowing 3D Text",
    "7": "Spaceship Title Screen",
    "8": "3D Projection",
    "9": "Game Intro",
    "10": "Egypt Video",
    "11": "Elementor Site",
    "12": "Capstone Project",
    "13": "Salesforce - MasterSeal"
  },
  "NavBar": {
    "1": "Home",
    "2": "About Me"
  },
  "LanguagesAndSoftware": {
    "1": "MERN Stack",
    "2": "Auth0",
    "3": "Bootstrap",
    "4": "React",
    "5": "Filter & Sort",
    "6": "JavaScript",
    "7": "Jest",
    "8": "C#",
    "9": "Unity",
    "10": "CSS Grid",
    "11": "Cinema 4D",
    "12": "Premiere Pro",
    "13": "After Effects",
    "14": "Photoshop",
    "15": "Go Pro",
    "16": "Elementor",
    "17": "Figma",
    "18": "Custom CSS",
    "19": "Filter function",
    "20": "Salesforce",
    "21": "Canva"
  },
  "Links": {
    "1": "Live Demo"
  },
  "Spotify": {
    "1": "Here's a taste of the music I enjoy!"
  },
  "ProjectContent": {
    "1": "The Reservationizr was the 2nd project of my Server-Side paper at the Developers Institute. It allows a user to log in to their account via Auth0 and view the reservations that they have made with specific restaurants. It uses React for the front end with Auth0's protected routes to filter out what content a user can see based on whether they are logged in or not. It is using Express.js along with JWT's for the GET and POST API requests, along with Node.js as the server language. This server is talking to a MongoDB Atlas database which stores the JSON data collections. In the future, I would like to add PATCH and DELETE requests to give the user more control over thier reservations.",
    "2": "This Bootstrap website was my very first attempt at a portfolio website, before I had learnt React. It's core focus was to teach me Bootstrap, whilst using my previous knowledge of HTML, CSS and some JavaScript. I was influenced by the grid style layout that you often see on photography pages/portfolios. The image grids within each nav-link follow the photography page style, where all images are different sizes, however they still fit nicely within a rectangle container. In order to push this project live, I used React and Vite to create a build through the GitHub repository.",
    "3": "Jap Snack was my third project of the Client-Side paper at the Developers Institute. It is a website that allows a user to purchase Japanese Snacks. It is the first website that I have used React. We used Stripe to feature projects that a user could purchase. There is also the ability to filter products by specific category and sort the list of products by the highest and lowest prices.",
    "4": "The Adrenaline Bot was the second project of the Client-Side paper. It uses JavaScript conditional blocks of code to check user input based on the options that it has given to the user. It uses edge cases to make sure that it can provide the best direction and user experience possible. For example, if the user types 'skydive' when requested, it will still give them the option, as if they typed 'sky dive'. It also stores the user's name that they enter and refers to them during their interaction with the Chat Bot.",
    "5": "This project is my pride and joy! I took a C# course through Udemy and have decided to put that language to the test through Unity. I have followed the HexMap tutorial by CatLikeCoding to generate a single plane in Unity which morphs into a tile map. This tile map can be customized by the player, however long term I would like it to generate a map upon the awakening of that scene. At the moment a have a shape in place of a unit that a player can control and move using A* pathfinding to determine the shortest route to travel. Long term I would like to turn this into a game similar to Jurassic World Alive, but with an XCOM styled battle system.",
    "6": "This project is an example of my 3D and video editing abilities. Firstly, I created the 3D glowing text in Cinema 4D with 4 different cameras, each animated around the text in their own way. Then I saved each component in Cinema 4D so that they would appear on a different layer in After Effects. This allowed me to cut the footage based on the each camera layer. Finally, I added music and the polished the editing in Premiere Pro.",
    "7": "The Futuristic Spaceship Title screen is a project that I created in order to showcase some of my work in a small portfolio styled video that I could use to introduce my passions, work and showcase my 3D and video editing skills. It features work that I have done in Adobe Illustrator and other videos I have made. I have used Corona Render to speed up render times and enhance the render result. I have added effects through After Effects and edited the music and sound effects through Premiere Pro.",
    "8": "This sci-fi city is actually a 2D image that has been split into multiple layers with the help of the 3D projection software/add-on in After Effects. This allows the camera to give the feeling of rotation around the image with the different layers changing in dimension and location, giving a 3D feel. This element, along with the 3D spaceships, tricks the eye into thinking that the entire scene is in 3D.",
    "9": "This video was originally for the Unity game (before the name changed). It is a small intro video using bevelled font in Premiere Pro. The logo was created in Photoshop and then bevelled in Premiere Pro. There is a mix of music in the background, edited with Premiere Pro.",
    "10": "One of my greatest passions is creating home video styled videos with my Go Pro, that I can look back on. I have tried to document all the travel that I have been lucky enough to do. I use Premiere Pro to edit the footage and create a specific feel depending on the video. The feel I have tried to create with this video, is a very calm and relaxing video that relates to the feel of the Nile river and the relaxed lifestyle of the Nubian people. This is seen with the music choice (an Egytian artists) and the length of each scene. I have used the DJ software Virtual DJ to edit and have greater control over the music, due to the quick manipulation I can do with my DJ controller.",
    "11": "This is the first project/website that I have made through the Elementor plugin in Wordpress. It was a development test for the role of Intern Wordpress Developer with the company, The Web Guys. It utilises blending of sections, JavaScript to hide and change content, horizontal scrolling and is responsive. I found Elementor to be straight forward to use and add custom CSS to. My approach for creating this website was to experiment, add elements that I was not familiar with and break the layout with the intention to learn as much as I could and how I can approach each design element differently to increase my overall familiarity with Elementor and Wordpress.",
    "12": "This is my Capstone Project that I have created whilst studying at Whitecliffe. We were instructed to find a client who had encountered numerous problems and requires an online presence or a refactored online presence. This web application was created for a local landscaper who was looking to have better reach to their customers or potential customers. The project required the use of CSS3, JavaScript and HTML5. I have also utilised Bootstrap for responsive purposes and React for deployment purposes. The project underwent planning that included business and stakeholder requirements, functional and non-functional requirements, UI design and test planning. UAT, usability and cross-browser testing was utilised to ensure the web application functioned as required and consistently over multiple browsers and devices.",
    "13": "This was a real-world project that I completed during my studies at NextWork. It involved the migration of MasterSeal Exteriors' data and business processes from Excel to Salesforce. I implemented this project in a developer's org, covering various areas such as flows, email templates, auto-response rules, queues, web-to-lead, approval processes, sales processes, invoices via third-party products in the AppExchange, surveys, permission sets, profiles, and much more, as detailed in the technical documentation. My approach to this project included a lot of experimenting and exploring new areas to learn as much as I can."
  },
  "OtherProjects": {
    "1": "Other Projects"
  }
}
